# ==========================================
# โจทย์ข้อที่ 3: คำนวณราคาสินค้าตามสถานะสมาชิก
# Input: บรรทัดที่ 1 ราคาสินค้าเต็ม (price), บรรทัดที่ 2 สถานะสมาชิก (is_member: 1 คือเป็นสมาชิก, 0 คือไม่เป็น)
# Output: ราคาสินค้าสุทธิ (หากเป็นสมาชิก ลดทันที 10%)
# ==========================================


# นักเรียนเขียนโค้ดต่อจากบรรทัดนี้
price = float(input())
is_member = int(input())
if n = price
if is_member : 1
   print ("เป็นสมาชิก")
elif :
   is_member : 0
   print ("ไม่เป็นสมาชิก")
else :
   print = int(input("หากเป็นสมาชิก ลดทันที 10%"))
